linear-algebra-1.html
<!DOCTYPE html>
<html>
<head>
<title>Linear Algebra Part 1</title>
<!-- 2013-10-19 Sat 00:25 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<link rel="stylesheet" href="/static/style.css" type="text/css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="preamble" class="status">
Hello hello moshi moshi ciao ciao busy busy
</div>
<div id="content">
<h1 class="title">Linear Algebra Part 1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Vectors</a>
<ul>
<li><a href="#sec-1-1">Vector Operations</a></li>
</ul>
</li>
<li><a href="#sec-2">Vector Spaces</a></li>
<li><a href="#sec-3">Matrices</a></li>
</ul>
</div>
</div>
<p>
Because Linear Algebra really doesn't need several semesters. It's syntax.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Vectors</h2>
<div class="outline-text-2" id="text-1">
<p>
On a real number line, we can describe any point by a single number. In more
than one dimension, to describe a point, we need more than a single number. In
2D space (\(\mathbb{R}^2\)), we conventionally denote points by their \(x\) and \(y\)
coordinates.
\[ (x, y) \in \mathbb{R}^2
\]
</p>

<p>
In three dimensions, we'd have three coordinates, and in higher dimensional
space we'd need even more. (We actually mean a vector space: see
<a href="#sec-2">Vector Spaces</a>).
</p>

<p>
We can define vectors as a tuple (fixed collection) of numbers, or in other
forms. The following is <i>column vector</i> <a id="column-vector" name="column-vector"></a> form.
\[\begin{bmatrix} x_1 \\ \vdots \\ x_n \end{bmatrix} \in \mathbb{R}^n
\]
</p>

<p>
There is also row vector form, which is much the same, except horizontally.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="todo TODO">TODO</span> Vector Operations</h3>
<div class="outline-text-3" id="text-1-1">
<p>
We can perform operations on these points, like adding them together, which
is pretty much what you expect.
\[(x_1, y_1) + (x_2, y_2) = (x_1 + x_2, y_1 + y_2) \in \mathbb{R}^2
\]
Subtraction is quite similar.
</p>

<p>
There are a few slightly more interesting operations on vectors we can
define. For example, what is the product of two multidimensional numbers? Does
it make sense to multiply \((3, 9)\) by \(2\)? What about \((1, 2) \times (3, 4, 5)\)?
</p>

<p>
The first case seems reasonable. If we move north 5m and east 2m, then we can
indeed think of 'doubling' the distance we've just travelled, by moving north
10m and east 4m.
\[2 \times \begin{bmatrix} 5 \\ 2 \end{bmatrix} = \begin{bmatrix} 10 \\ 4 \end{bmatrix}
\]
</p>

<p>
Multiplying a vector by a vector is not the same, though. Multiplying the
individual components of one vector by another has proven to not be very useful
in practice, and mathematicians and physicists have come up with other, more
useful operations.
</p>

<p>
The most common one we will run into is the <i>vector dot product</i>, which is the
sum of the product of every component of a vector:
\[\begin{bmatrix} 1 \\ 3 \end{bmatrix} . \begin{bmatrix} 2 \\ 0 \end{bmatrix}
  = 1 \times 2 + 3 \times 0 = 2
\]
</p>

<p>
This takes two vectors in the same space and returns a real number. For
applications of the dot product, we have ??????????????????????????????????
</p>

<p>
There is also the cross product, but I'm not sure if there are any useful
applications of that in what we'll be studying.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="todo TODO">TODO</span> Vector Spaces</h2>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="todo TODO">TODO</span> Matrices</h2>
</div>
</div>
<div id="postamble" class="status">
Copyright &copy; 2013 Nathan Yong
</div>
</body>
</html>
